In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
obj = pd.Series(range(4),index=list('dabc'))

In [5]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [6]:
frame = pd.DataFrame(np.arange(8).reshape(2,4),index= ['three','one'],columns=list('dabc')  )

In [7]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [8]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [9]:
frame.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [11]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [12]:
obj = pd.Series(np.random.randint(1,10,[5,]))

In [13]:
obj

0    4
1    3
2    5
3    4
4    7
dtype: int64

In [15]:
obj.sort_values()

1    3
0    4
3    4
2    5
4    7
dtype: int64

In [16]:
obj = pd.Series([4,np.nan,5,np.nan,-3,4])

In [18]:
obj.sort_values()

4   -3.0
0    4.0
5    4.0
2    5.0
1    NaN
3    NaN
dtype: float64

In [19]:
frame = pd.DataFrame({'b':[4,-7,-3,2],'a':[0,1,0,1]})

In [20]:
frame

   b  a
0  4  0
1 -7  1
2 -3  0
3  2  1

In [21]:
frame.sort_values(by='b')

   b  a
1 -7  1
2 -3  0
3  2  1
0  4  0

In [22]:
frame.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1 -7  1
3  2  1

In [24]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
1 -7  1
3  2  1

In [2]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [3]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [4]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [5]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [6]:
obj.rank(ascending=False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [7]:
frame = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [8]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [9]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [10]:
frame.rank(axis='row')

ValueError: No axis named row for object type <class 'pandas.core.frame.DataFrame'>

      排名中的评级关系打破方法
      方法          描述
      average     默认 在每个组中分配平均排名
      min           对整个组使用最小排名
      max          对整个组使用最大排名
      first          按照值在数据中出现的次序分配排名
      dense       类似于 method = 'min' 但组间排名总是增加1 而不是一个组中的相等元素的数量